## Corey Solitaire
## 8/13
## Dataframes Lesson

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
from pydataset import data

   ## 1. Copy the code from the lesson to create a dataframe full of student                  grades.

In [13]:
np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

student_grades = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades})

type(df)

pandas.core.frame.DataFrame

In [25]:
# a. Create a column named passing_english that indicates whether each student has a passing grade in reading.
student_grades['passing_english'] = student_grades.english > 70
student_grades

       name  math  english  reading  passing_english
0     Sally    62       85       80             True
1      Jane    88       79       67             True
2     Suzie    94       74       95             True
3     Billy    98       96       88             True
4       Ada    77       92       98             True
5      John    79       76       93             True
6    Thomas    82       64       81            False
7     Marie    93       63       90            False
8    Albert    92       62       87            False
9   Richard    69       80       94             True
10    Isaac    92       99       93             True
11     Alan    92       62       72            False

In [40]:
# b. Sort the english grades by the passing_english column. How are duplicates handled?
        
passing_english = student_grades.sort_values(by = 'passing_english')
passing_english
# The sort returns boolean values, so there are no duplicates

       name  math  english  reading  passing_english
6    Thomas    82       64       81            False
7     Marie    93       63       90            False
8    Albert    92       62       87            False
11     Alan    92       62       72            False
0     Sally    62       85       80             True
1      Jane    88       79       67             True
2     Suzie    94       74       95             True
3     Billy    98       96       88             True
4       Ada    77       92       98             True
5      John    79       76       93             True
9   Richard    69       80       94             True
10    Isaac    92       99       93             True

In [54]:
# c. Sort the english grades first by passing_english and then by student name. All the students that are 
#    failing english should be first, and within the students that are failing english they should be ordered 
#    alphabetically. The same should be true for the students passing english. (Hint: you can pass a list to 
#    the .sort_values method)


sorted_grades = student_grades.sort_values(by = 'passing_english').groupby(['passing_english']).apply(lambda x: x.sort_values([
    'name'
]))
sorted_grades

                       name  math  english  reading  passing_english
passing_english
False           11     Alan    92       62       72            False
                8    Albert    92       62       87            False
                7     Marie    93       63       90            False
                6    Thomas    82       64       81            False
True            4       Ada    77       92       98             True
                3     Billy    98       96       88             True
                10    Isaac    92       99       93             True
                1      Jane    88       79       67             True
                5      John    79       76       93             True
                9   Richard    69       80       94             True
                0     Sally    62       85       80             True
                2     Suzie    94       74       95             True

In [55]:
# d. Sort the english grades first by passing_english, and then by the actual english grade, similar to 
#    how we did in the last step.
             
    
more_sorted_grades = student_grades.sort_values(by = 'passing_english').groupby(['passing_english']).apply(lambda x: x.sort_values([
    'english'
]))
more_sorted_grades

                       name  math  english  reading  passing_english
passing_english
False           8    Albert    92       62       87            False
                11     Alan    92       62       72            False
                7     Marie    93       63       90            False
                6    Thomas    82       64       81            False
True            2     Suzie    94       74       95             True
                5      John    79       76       93             True
                1      Jane    88       79       67             True
                9   Richard    69       80       94             True
                0     Sally    62       85       80             True
                4       Ada    77       92       98             True
                3     Billy    98       96       88             True
                10    Isaac    92       99       93             True

In [66]:
# e. Calculate each students overall grade and add it as a column on the dataframe. The overall grade is 
#    the average of the math, english, and reading grades.

overall_grade = (student_grades.math + student_grades.english + student_grades.reading) / 3
# overall_grade

student_grades['overall_grade'] = overall_grade
student_grades

       name  math  english  reading  passing_english  overall_grade
0     Sally    62       85       80             True      75.666667
1      Jane    88       79       67             True      78.000000
2     Suzie    94       74       95             True      87.666667
3     Billy    98       96       88             True      94.000000
4       Ada    77       92       98             True      89.000000
5      John    79       76       93             True      82.666667
6    Thomas    82       64       81            False      75.666667
7     Marie    93       63       90            False      82.000000
8    Albert    92       62       87            False      80.333333
9   Richard    69       80       94             True      81.000000
10    Isaac    92       99       93             True      94.666667
11     Alan    92       62       72            False      75.333333

## 2.Load the mpg dataset. Read the documentation for the dataset and use it for the following questions:

In [71]:
mpg_df = data('mpg')
mpg_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [72]:
# a. How many rows and columns are there?
mpg_df.shape
# Tuple (Rows/Columns)

(234, 11)

In [73]:
mpg_df.info

<bound method DataFrame.info of     manufacturer   model  displ  year  cyl       trans drv  cty  hwy fl  \
1           audi      a4    1.8  1999    4    auto(l5)   f   18   29  p
2           audi      a4    1.8  1999    4  manual(m5)   f   21   29  p
3           audi      a4    2.0  2008    4  manual(m6)   f   20   31  p
4           audi      a4    2.0  2008    4    auto(av)   f   21   30  p
5           audi      a4    2.8  1999    6    auto(l5)   f   16   26  p
..           ...     ...    ...   ...  ...         ...  ..  ...  ... ..
230   volkswagen  passat    2.0  2008    4    auto(s6)   f   19   28  p
231   volkswagen  passat    2.0  2008    4  manual(m6)   f   21   29  p
232   volkswagen  passat    2.8  1999    6    auto(l5)   f   16   26  p
233   volkswagen  passat    2.8  1999    6  manual(m5)   f   18   26  p
234   volkswagen  passat    3.6  2008    6    auto(s6)   f   17   26  p

       class
1    compact
2    compact
3    compact
4    compact
5    compact
..       ...
230  midsize
231  midsize
232  midsize
233  midsize
234  midsize

[234 rows x 11 columns]>

In [74]:
# b. What are the data types of each column?
mpg_df.dtypes

manufacturer     object
model            object
displ           float64
year              int64
cyl               int64
trans            object
drv              object
cty               int64
hwy               int64
fl               object
class            object
dtype: object

In [ ]:
# c. Summarize the dataframe with .info and .describe

In [ ]:
# d. Rename the cty column to city.

In [ ]:
# e. Rename the hwy column to highway.

In [ ]:
# f. Do any cars have better city mileage than highway mileage?

In [ ]:
# g. Create a column named mileage_difference this column should contain the difference between highway and  
#    city mileage for each car.

In [ ]:
# h. Which car (or cars) has the highest mileage difference?

In [ ]:
# i. Which compact class car has the lowest highway mileage? The best?

In [ ]:
# j. Create a column named average_mileage that is the mean of the city and highway mileage.

In [ ]:
# k. Which dodge car has the best average mileage? The worst?

## 3. Load the Mammals dataset. Read the documentation for it, and use the data to answer these questions:

In [10]:
mammals = data('mammals')
mammals.info()

<class 'pandas.core.frame.DataFrame'>
Index: 62 entries, Arctic fox to Red fox
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   body    62 non-null     float64
 1   brain   62 non-null     float64
dtypes: float64(2)
memory usage: 1.5+ KB

In [ ]:
# a. How many rows and columns are there?

In [ ]:
# b. What are the data types?

In [ ]:
# c. Summarize the dataframe with .info and .describe

In [ ]:
# d. What is the the weight of the fastest animal?

In [ ]:
# e. What is the overal percentage of specials?

In [ ]:
# f. How many animals are hoppers that are above the median speed? What percentage is this?